903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
#include "oled.h"
#include "oled_data.h"

#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
#define	__oled_io_clock_enable(port)	{	if (port == GPIOA)		{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);} \
											else if (port == GPIOB)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);} \
											else if (port == GPIOC)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);} \
											else if (port == GPIOD)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);} \
											else if (port == GPIOE)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE);} \
											else if (port == GPIOF)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOF, ENABLE);} \
											else if (port == GPIOG)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOG, ENABLE);} \
										}
												
#define	__oled_dma_clock_enable(spix)	{	if (spix == SPI1)		{RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);} \
											else if (spix == SPI2)	{RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);} \
											else if (spix == SPI3)	{RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);} \
										}
													
#define	__oled_config_io_out_pp(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_InitStructure.GPIO_Pin = pin; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define __oled_io_write(port ,pin, value)	GPIO_WriteBit(port ,pin, (BitAction)value)

#define	__oled_get_dma_channel(spix)	(	spix == SPI1 ? DMA1_Channel3 : \
											spix == SPI2 ? DMA1_Channel5 : \
											spix == SPI3 ? DMA2_Channel2 : \
											(int)0)
												
#define	__oled_get_dma_flag(spix)	(	spix == SPI1 ? DMA1_FLAG_TC3 : \
										spix == SPI2 ? DMA1_FLAG_TC5 : \
										spix == SPI3 ? DMA2_FLAG_TC2 : \
										(int)0)
			
#elif defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F429_439xx)

#define	__oled_io_clock_enable(port)	{	if (port == GPIOA)		{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);} \
											else if (port == GPIOB)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);} \
											else if (port == GPIOC)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);} \
											else if (port == GPIOD)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);} \
											else if (port == GPIOE)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);} \
											else if (port == GPIOF)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);} \
											else if (port == GPIOG)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);} \
										}

#define	__oled_dma_clock_enable(spix)	{	if (spix == SPI1)		{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);} \
											else if (spix == SPI2)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);} \
											else if (spix == SPI3)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);} \
										}
													
#define	__oled_config_io_out_pp(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT; \
												GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; \
												GPIO_InitStructure.GPIO_Pin = pin ; \
												GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define __oled_io_write(port ,pin, value)	GPIO_WriteBit(port ,pin, (BitAction)value)
											
#define __oled_get_dma_stream(spix)	(	spix == SPI1 ? DMA2_Stream3 : \
										spix == SPI2 ? DMA1_Stream4 : \
										spix == SPI3 ? DMA1_Stream5 : \
										(int)0)

#define	__oled_get_dma_channel(spix)	(	spix == SPI1 ? DMA_Channel_3 : \
											spix == SPI2 ? DMA_Channel_0 : \
											spix == SPI3 ? DMA_Channel_0 : \
											(int)0)
												
#define	__oled_get_dma_flag(spix)	(	spix == SPI1 ? DMA_FLAG_TCIF3 : \
										spix == SPI2 ? DMA_FLAG_TCIF4 : \
										spix == SPI3 ? DMA_FLAG_TCIF5 : \
										(int)0)
											
#endif

/* 最大OLED设备数量 */			
#define MAX_OLED_NUM 1

/**
  * OLED显存数组
  * 所有的显示函数，都只是对此显存数组进行读写
  * 随后调用__oled_update函数或__oled_update_area函数
  * 才会将显存数组的数据发送到OLED硬件，进行显示
  */
uint8_t g_oled_display_buf[MAX_OLED_NUM][8][128];			
						
/* 全局变量用于给注册的OLED设备分配索引 */
static uint8_t g_index = 0;

/* OLED私有数据结构体 */
typedef struct {
	spi_hard_dev_t spi;	// 硬件SPI设备
	uint8_t index;		// 索引
} oled_priv_data_t;
				
/* 通信协议 */
static void __oled_res_write(oled_dev_t *dev, uint8_t bit_val);
static void __oled_dc_write(oled_dev_t *dev, uint8_t bit_val);
static int __oled_write_command(oled_dev_t *dev, uint8_t command);
static int __oled_write_data(oled_dev_t *dev, uint8_t *data, uint8_t count);
static int __oled_write_data_dma(oled_dev_t *dev, uint8_t *data, uint16_t count);

/* 功能函数 */
static int __oled_update(oled_dev_t *dev);
static int __oled_update_area(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height);
static int __oled_clear(oled_dev_t *dev);
static int __oled_clear_area(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height);
static int __oled_reverse(oled_dev_t *dev);
static int __oled_reverse_area(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height);
static int __oled_show_image(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, const uint8_t *image);
static int __oled_show_char(oled_dev_t *dev, uint8_t x, uint8_t y, char chr, uint8_t size);
static int __oled_show_string(oled_dev_t *dev, uint8_t x, uint8_t y, char *string, uint8_t size);
static int __oled_show_num(oled_dev_t *dev, uint8_t x, uint8_t y, uint32_t num, uint8_t len, uint8_t size);
static int __oled_show_signed_num(oled_dev_t *dev, uint8_t x, uint8_t y, int32_t num, uint8_t len, uint8_t size);
static int __oled_show_hex_num(oled_dev_t *dev, uint8_t x, uint8_t y, uint32_t num, uint8_t len, uint8_t size);
static int __oled_show_bin_num(oled_dev_t *dev, uint8_t x, uint8_t y, uint32_t num, uint8_t len, uint8_t size);
static int __oled_show_float_num(oled_dev_t *dev, uint8_t x, uint8_t y, double num, uint8_t int_len, uint8_t fra_len, uint8_t size);
static int __oled_show_chinese(oled_dev_t *dev, uint8_t x, uint8_t y, char *chinese);
static int __oled_printf(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t size, char *format, ...);
static int __oled_draw_point(oled_dev_t *dev, uint8_t x, uint8_t y);
static uint8_t __oled_get_point(oled_dev_t *dev, uint8_t x, uint8_t y);
static int __oled_draw_line(oled_dev_t *dev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1);
static int __oled_draw_rectangle(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint8_t is_filled);
static int __oled_draw_triangle(oled_dev_t *dev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint8_t is_filled);
static int __oled_draw_circle(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t radius, uint8_t is_filled);
static int __oled_draw_ellipse(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t a, uint8_t b, uint8_t is_filled);
static int __oled_draw_arc(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t radius, int16_t start_angle, int16_t end_angle, uint8_t is_filled);
static int __oled_deinit(oled_dev_t *dev);

