903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
/******************************************************************************
 * @brief	初始化OLED
 * @param	dev		:	oled_dev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
int oled_init(oled_dev_t *dev)
{
	if (!dev)
		return -1;
	
	/* 在初始化前，加入适量延时，待OLED供电稳定 */
	for (uint32_t i = 0; i < 1000; i ++)
		for (uint32_t j = 0; j < 1000; j ++);
	
	/* 保存私有数据 */
	dev->priv_data = (oled_priv_data_t *)malloc(sizeof(oled_priv_data_t));
	if (!dev->priv_data)
		return -1;
	
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	priv_data->spi.config.spix = dev->config.spix;
	priv_data->spi.config.sck_port = dev->config.sck_port;
	priv_data->spi.config.sck_pin = dev->config.sck_pin;
	priv_data->spi.config.mosi_port = dev->config.mosi_port;
	priv_data->spi.config.mosi_pin = dev->config.mosi_pin;
	priv_data->spi.config.miso_port = NULL;
	priv_data->spi.config.miso_pin = NULL;
	priv_data->spi.config.cs_port = dev->config.cs_port;
	priv_data->spi.config.cs_pin = dev->config.cs_pin;
	priv_data->spi.config.prescaler = dev->config.prescaler;
	priv_data->spi.config.mode = dev->config.mode;
	
	priv_data->index = g_index++;
	
	/* 配置硬件SPI */
	spi_hard_init(&priv_data->spi);
	
	/* 配置时钟与GPIO */
	__oled_io_clock_enable(dev->config.res_port);
	__oled_io_clock_enable(dev->config.dc_port);
	
	__oled_config_io_out_pp(dev->config.res_port, dev->config.res_pin);
	__oled_config_io_out_pp(dev->config.dc_port, dev->config.dc_pin);
	
	/* 置引脚默认电平 */
	__oled_res_write(dev, 1);
	__oled_dc_write(dev, 1);
	priv_data->spi.cs_write(&priv_data->spi, 1);
	
	/* 函数指针赋值 */
	dev->update = __oled_update;
	dev->update_area = __oled_update_area;
	dev->clear = __oled_clear;
	dev->clear_area = __oled_clear_area;
	dev->reverse = __oled_reverse;
	dev->reverse_area = __oled_reverse_area;
	dev->show_image = __oled_show_image;
	dev->show_char = __oled_show_char;
	dev->show_string = __oled_show_string;
	dev->show_num = __oled_show_num;
	dev->show_signed_num = __oled_show_signed_num;
	dev->show_hex_num = __oled_show_hex_num;
	dev->show_bin_num = __oled_show_bin_num;
	dev->show_float_num = __oled_show_float_num;
	dev->show_chinese = __oled_show_chinese;
	dev->printf = __oled_printf;
	dev->draw_point = __oled_draw_point;
	dev->get_point = __oled_get_point;
	dev->draw_line = __oled_draw_line;
	dev->draw_rectangle = __oled_draw_rectangle;
	dev->draw_triangle = __oled_draw_triangle;
	dev->draw_circle = __oled_draw_circle;
	dev->draw_ellipse = __oled_draw_ellipse;
	dev->draw_arc = __oled_draw_arc;
	dev->deinit = __oled_deinit;
	
	dev->init_flag = true;
	
	/* 配置OLED */
	__oled_write_command(dev, 0xAE);	// 设置显示开启/关闭，0xAE关闭，0xAF开启
	
	__oled_write_command(dev, 0xD5);	// 设置显示时钟分频比/振荡器频率
	__oled_write_command(dev, 0x80);	// 0x00~0xFF
	
	__oled_write_command(dev, 0xA8);	// 设置多路复用率
	__oled_write_command(dev, 0x3F);	// 0x0E~0x3F
	
	__oled_write_command(dev, 0xD3);	// 设置显示偏移
	__oled_write_command(dev, 0x00);	// 0x00~0x7F
	
	__oled_write_command(dev, 0x40);	// 设置显示开始行，0x40~0x7F
	
	if(!OLED_DIRECTION)
	{
		__oled_write_command(dev, 0xA1);	// 设置左右方向，0xA1正常，0xA0左右反置
		__oled_write_command(dev, 0xC8);	// 设置上下方向，0xC8正常，0xC0上下反置
	}
	else
	{
		__oled_write_command(dev, 0xA0);	// 设置左右方向，0xA1正常，0xA0左右反置
		__oled_write_command(dev, 0xC0);	// 设置上下方向，0xC8正常，0xC0上下反置
	}
	
	__oled_write_command(dev, 0xDA);	// 设置COM引脚硬件配置
	__oled_write_command(dev, 0x12);
	
	__oled_write_command(dev, 0x81);	// 设置对比度
	__oled_write_command(dev, 0xCF);	// 0x00~0xFF
	
	__oled_write_command(dev, 0xD9);	// 设置预充电周期
	__oled_write_command(dev, 0xF1);
	
	__oled_write_command(dev, 0xDB);	// 设置VCOMH取消选择级别
	__oled_write_command(dev, 0x30);
	
	__oled_write_command(dev, 0xA4);	// 设置整个显示打开/关闭
	
	__oled_write_command(dev, 0xA6);	// 设置正常/反色显示，0xA6正常，0xA7反色
	
	__oled_write_command(dev, 0x8D);	// 设置充电泵
	__oled_write_command(dev, 0x14);

	__oled_write_command(dev, 0xAF);	// 开启显示
	
	__oled_clear(dev);					// 清空显存数组
	__oled_update(dev);				// 更新显示，清屏，防止初始化后未显示内容时花屏

	return 0;
}

/*通信协议*********************************************************************/

/******************************************************************************
 * @brief	OLED写RES高低电平
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	bit_val	:	要写入RES的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __oled_res_write(oled_dev_t *dev, uint8_t bit_val)
{
	__oled_io_write(dev->config.res_port, dev->config.res_pin, bit_val);
}

/******************************************************************************
 * @brief	OLED写DC高低电平
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	bit_val	:	要写入DC的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __oled_dc_write(oled_dev_t *dev, uint8_t bit_val)
{
	__oled_io_write(dev->config.dc_port, dev->config.dc_pin, bit_val);
}

/******************************************************************************
 * @brief	OLED写命令
 * @param	dev	:	oled_dev_t 结构体指针
 * @param	command	:	要写入的命令值，范围：0x00~0xFF
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_write_command(oled_dev_t *dev, uint8_t command)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	priv_data->spi.start(&priv_data->spi);					// 拉低CS，开始通信
	__oled_dc_write(dev, 0);									// 拉低DC，表示即将发送命令
	priv_data->spi.swap_byte(&priv_data->spi, command);		// 写入指定命令
	priv_data->spi.stop(&priv_data->spi);						// 拉高CS，结束通信
	
	return 0;
}

/******************************************************************************
 * @brief	OLED写数据
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	data	:	要写入数据的起始地址
 * @param	count	:	要写入数据的数量
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_write_data(oled_dev_t *dev, uint8_t *data, uint8_t count)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i;
	
	priv_data->spi.start(&priv_data->spi);				// 拉低CS，开始通信
	__oled_dc_write(dev, 1);								// 拉高DC，表示即将发送数据
	/* 循环count次，进行连续的数据写入 */
	for (i = 0; i < count; i++)
	{
		priv_data->spi.swap_byte(&priv_data->spi, data[i]);
	}
	priv_data->spi.stop(&priv_data->spi);					// 拉高CS，结束通信
	
