903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
	return 0;
}

/******************************************************************************
 * @brief	OLED写数据（DMA）
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	data	:	要写入数据的起始地址
 * @param	count	:	要写入数据的数量
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_write_data_dma(oled_dev_t *dev, uint8_t *data, uint16_t count)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	if (!dev || !dev->init_flag) return -1;
	
	priv_data->spi.start(&priv_data->spi);				// SPI起始
	__oled_dc_write(dev, 1);								// 拉高DC，表示即将发送数据
	
	__oled_dma_clock_enable(dev->config.spix);		// 开启DMA时钟
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	DMA_InitTypeDef DMA_InitStructure;
	DMA_DeInit(__oled_get_dma_channel(dev->config.spix));
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->config.spix->DR;
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)data;
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
	DMA_InitStructure.DMA_BufferSize = count;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init(__oled_get_dma_channel(dev->config.spix), &DMA_InitStructure);
	
	SPI_I2S_DMACmd(dev->config.spix, SPI_I2S_DMAReq_Tx, ENABLE);			// 配置SPI为DMA模式
	
	DMA_Cmd(__oled_get_dma_channel(dev->config.spix), ENABLE);			// 启动DMA传输
	
	while (!DMA_GetFlagStatus(__oled_get_dma_flag(dev->config.spix)));	// 等待DMA传输完成
	
	DMA_ClearFlag(__oled_get_dma_flag(dev->config.spix));				// 清除DMA传输完成标志
	
	DMA_Cmd(__oled_get_dma_channel(dev->config.spix), DISABLE);			// 禁用DMA传输
	
	#elif defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F429_439xx)
	
	DMA_InitTypeDef DMA_InitStructure;
	DMA_DeInit(__oled_get_dma_stream(dev->config.spix));
	DMA_InitStructure.DMA_Channel = __oled_get_dma_channel(dev->config.spix);
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->config.spix->DR;
	DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)data;
	DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	DMA_InitStructure.DMA_BufferSize = count;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
	DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
	DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
	DMA_Init(__oled_get_dma_stream(dev->config.spix), &DMA_InitStructure);
	
	SPI_I2S_DMACmd(dev->config.spix, SPI_I2S_DMAReq_Tx, ENABLE);				// 配置SPI为DMA模式
	
	DMA_Cmd(__oled_get_dma_stream(dev->config.spix), ENABLE);					// 启动DMA传输
	
	while (!DMA_GetFlagStatus(	__oled_get_dma_stream(dev->config.spix), 
								__oled_get_dma_flag(dev->config.spix))	);	// 等待DMA传输完成
	
	DMA_ClearFlag(	__oled_get_dma_stream(dev->config.spix), 
					__oled_get_dma_flag(dev->config.spix)	);					// 清除DMA传输完成标志
	
	DMA_Cmd(__oled_get_dma_stream(dev->config.spix), DISABLE);				// 禁用DMA传输
	
	#endif
	
	priv_data->spi.stop(&priv_data->spi);	// SPI终止
	
	return 0;
}

/**********************************************************************通信协议*/

/*硬件配置**********************************************************************/

/******************************************************************************
 * @brief	OLED设置显示光标位置，OLED默认的y轴，只能8个Bit为一组写入，即1页等于8个y轴坐标
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	page	:	指定光标所在的页，范围：0~7
 * @param	x		:	指定光标所在的x轴坐标，范围：0~127
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int OLED_SetCursor(oled_dev_t *dev, uint8_t page, uint8_t x)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	/*如果使用此程序驱动1.3寸的OLED显示屏，则需要解除此注释*/
	/*因为1.3寸的OLED驱动芯片（SH1106）有132列*/
	/*屏幕的起始列接在了第2列，而不是第0列*/
	/*所以需要将x加2，才能正常显示*/
//	x += 2;
	
	/* 通过指令设置页地址和列地址 */
	__oled_write_command(dev, 0xB0 | page);				// 设置页位置
	__oled_write_command(dev, 0x10 | ((x & 0xF0) >> 4));	// 设置x位置高4位
	__oled_write_command(dev, 0x00 | (x & 0x0F));			// 设置x位置低4位
	
	return 0;
}

/**********************************************************************硬件配置*/

/*工具函数**********************************************************************/

/******************************************************************************
 * @brief	次方函数
 * @param	x	:	底数
 * @param	y	:	指数
 * @return	x^y
 ******************************************************************************/
static uint32_t __oled_pow(uint32_t x, uint32_t y)
{
	uint32_t result = 1;	// 结果默认为1
	while (y --)			// 累乘y次
	{
		result *= x;		// 每次把x累乘到结果上
	}
	return result;
}

/******************************************************************************
 * @brief	判断指定点是否在指定多边形内部
 * @param	nvert		:	多边形的顶点数
 * @param	vertx verty	:	包含多边形顶点的x和y坐标的数组
 * @param	testx testy	:	测试点的x和y坐标
 * @return	指定点是否在指定多边形内部，1：在内部，0：不在内部
 ******************************************************************************/
static uint8_t __oled_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
{
	int16_t i, j, c = 0;
	
	/*此算法由W. Randolph Franklin提出*/
	/*参考链接：https://wrfranklin.org/Research/Short_Notes/pnpoly.html*/
	for (i = 0, j = nvert - 1; i < nvert; j = i++)
	{
		if (((verty[i] > testy) != (verty[j] > testy)) &&
			(testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
		{
			c = !c;
		}
	}
	return c;
}

/******************************************************************************
 * @brief	判断指定点是否在指定角度内部
 * @param	x y						:	指定点的坐标
 * @param	start_angle end_angle	:	起始角度和终止角度，范围：-180~180
			水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param	testx testy				:  测试点的x和y坐标
 * @return	指定点是否在指定角度内部，1：在内部，0：不在内部
 ******************************************************************************/
static uint8_t __oled_is_in_angle(int16_t x, int16_t y, int16_t start_angle, int16_t end_angle)
{
	int16_t point_angle;
	point_angle = atan2(y, x) / 3.14 * 180;	// 计算指定点的弧度，并转换为角度表示
	if (start_angle < end_angle)	// 起始角度小于终止角度的情况
	{
		/* 如果指定角度在起始终止角度之间，则判定指定点在指定角度 */
		if (point_angle >= start_angle && point_angle <= end_angle)
		{
			return 1;
		}
	}
	else			// 起始角度大于于终止角度的情况
	{
		/* 如果指定角度大于起始角度或者小于终止角度，则判定指定点在指定角度 */
		if (point_angle >= start_angle || point_angle <= end_angle)
		{
			return 1;
		}
	}
	return 0;		// 不满足以上条件，则判断判定指定点不在指定角度
}

/**********************************************************************工具函数*/

/*功能函数**********************************************************************/

