903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
/******************************************************************************
 * @brief	将OLED显存数组更新到OLED屏幕
 * @param	dev	:	oled_dev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_update(oled_dev_t *dev)
{
    oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
    if (!dev || !dev->init_flag) return -1;

    uint8_t j;
    /* 遍历每一页 */
    for (j = 0; j < 8; j++) {
        /* 设置光标位置为每一页的第一列 */
        OLED_SetCursor(dev, j, 0);

        /* 使用DMA传输数据 */
        __oled_write_data_dma(dev, g_oled_display_buf[priv_data->index][j], 128);
		//__oled_write_data(dev, g_oled_display_buf[priv_data->index][j], 128);
    }
    return 0;
}
/******************************************************************************
 * @brief	将OLED显存数组部分更新到OLED屏幕，此函数会至少更新参数指定的区域
			如果更新区域y轴只包含部分页，则同一页的剩余部分会跟随一起更新
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定区域左上角的横坐标，范围：0~127
 * @param	y		:	指定区域左上角的纵坐标，范围：0~63
 * @param	width	:	指定区域的宽度，范围：0~128
 * @param	height	:	指定区域的高度，范围：0~64
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_update_area(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t j;
	
	/* 参数检查，保证指定区域不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	if (x + width > 128) {width = 128 - x;}
	if (y + height > 64) {height = 64 - y;}
	
	/* 遍历指定区域涉及的相关页 */
	/* (y + height - 1) / 8 + 1的目的是(y + height) / 8并向上取整 */
	for (j = y / 8; j < (y + height - 1) / 8 + 1; j ++)
	{
		/* 设置光标位置为相关页的指定列 */
		OLED_SetCursor(dev, j, x);
		/* 连续写入width个数据，将显存数组的数据写入到OLED硬件 */
		__oled_write_data(dev, &g_oled_display_buf[priv_data->index][j][x], width);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组全部清零
 * @param	dev	:	oled_dev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_clear(oled_dev_t *dev)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				// 遍历8页
	{
		for (i = 0; i < 128; i ++)			// 遍历128列
		{
			g_oled_display_buf[priv_data->index][j][i] = 0x00;	// 将显存数组数据全部清零
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组部分清零
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定区域左上角的横坐标，范围：0~127
 * @param	y		:	指定区域左上角的纵坐标，范围：0~63
 * @param	width	:	指定区域的宽度，范围：0~128
 * @param	height	:	指定区域的高度，范围：0~64
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_clear_area(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i, j;
	
	/* 参数检查，保证指定区域不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	if (x + width > 128) {width = 128 - x;}
	if (y + height > 64) {height = 64 - y;}
	
	for (j = y; j < y + height; j ++)		// 遍历指定页
	{
		for (i = x; i < x + width; i ++)	// 遍历指定列
		{
			g_oled_display_buf[priv_data->index][j / 8][i] &= ~(0x01 << (j % 8));	// 将显存数组指定数据清零
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组全部取反
 * @param	dev	:	oled_dev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_reverse(oled_dev_t *dev)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				// 遍历8页
	{
		for (i = 0; i < 128; i ++)			// 遍历128列
		{
			g_oled_display_buf[priv_data->index][j][i] ^= 0xFF;	// 将显存数组数据全部取反
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	将OLED显存数组部分取反
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定区域左上角的横坐标，范围：0~127
 * @param	y		:	指定区域左上角的纵坐标，范围：0~63
 * @param	width	:	指定区域的宽度，范围：0~128
 * @param	height	:	指定区域的高度，范围：0~64
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_reverse_area(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i, j;
	
	/* 参数检查，保证指定区域不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	if (x + width > 128) {width = 128 - x;}
	if (y + height > 64) {height = 64 - y;}
	
	for (j = y; j < y + height; j ++)		// 遍历指定页
	{
		for (i = x; i < x + width; i ++)	// 遍历指定列
		{
			g_oled_display_buf[priv_data->index][j / 8][i] ^= 0x01 << (j % 8);	// 将显存数组指定数据取反
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示图像
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定图像左上角的横坐标，范围：0~127
 * @param	y		:	指定图像左上角的纵坐标，范围：0~63
 * @param	width	:	指定图像的宽度，范围：0~128
 * @param	height	:	指定图像的高度，范围：0~64
 * @param	image	:	指定要显示的图像
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_image(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, const uint8_t *image)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i, j;
	
	/* 参数检查，保证指定图像不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	
	/* 将图像所在区域清空 */
	__oled_clear_area(dev, x, y, width, height);
	
	/* 遍历指定图像涉及的相关页*/
	/* (height - 1) / 8 + 1的目的是height / 8并向上取整 */
	for (j = 0; j < (height - 1) / 8 + 1; j ++)
	{
		/* 遍历指定图像涉及的相关列 */
		for (i = 0; i < width; i ++)
		{
			/* 超出边界，则跳过显示 */
			if (x + i > 127) {break;}
			if (y / 8 + j > 7) {return -1;}
			
			/* 显示图像在当前页的内容 */
			g_oled_display_buf[priv_data->index][y / 8 + j][x + i] |= image[j * width + i] << (y % 8);
			
			/* 超出边界，则跳过显示 */
			/* 使用continue的目的是，下一页超出边界时，上一页的后续内容还需要继续显示 */
			if (y / 8 + j + 1 > 7) {continue;}
			
			/* 显示图像在下一页的内容 */
			g_oled_display_buf[priv_data->index][y / 8 + j + 1][x + i] |= image[j * width + i] >> (8 - y % 8);
		}
	}
	
