903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
	return 0;
}

/******************************************************************************
 * @brief	OLED显示一个字符
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定字符左上角的横坐标，范围：0~127
 * @param	y		:	指定区域左上角的纵坐标，范围：0~63
 * @param	chr		:	指定要显示的字符，范围：ASCII码可见字符
 * @param	size	:	指定字体大小
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_char(oled_dev_t *dev, uint8_t x, uint8_t y, char chr, uint8_t size)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	if (size == OLED_8X16)		// 字体为宽8像素，高16像素
	{
		/* 将ASCII字模库oled_f8x16的指定数据以8*16的图像格式显示 */
		__oled_show_image(dev, x, y, 8, 16, oled_f8x16[chr - ' ']);
	}
	else if(size == OLED_6X8)	//字体为宽6像素，高8像素
	{
		/* 将ASCII字模库oled_f6x8的指定数据以6*8的图像格式显示 */
		__oled_show_image(dev, x, y, 6, 8, oled_f6x8[chr - ' ']);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示字符串
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定字符串左上角的横坐标，范围：0~127
 * @param	y		:	指定字符串左上角的纵坐标，范围：0~63
 * @param	string	:	指定要显示的字符串，范围：ASCII码可见字符组成的字符串
 * @param	size	:	指定字体大小
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_string(oled_dev_t *dev, uint8_t x, uint8_t y, char *string, uint8_t size)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i;
	for (i = 0; string[i] != '\0'; i++)		//遍历字符串的每个字符
	{
		/* 调用__oled_show_char函数，依次显示每个字符 */
		__oled_show_char(dev, x + i * size, y, string[i], size);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示数字（十进制，正整数）
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定数字左上角的横坐标，范围：0~127
 * @param	y		:	指定数字左上角的纵坐标，范围：0~63
 * @param	num		:	指定要显示的数字，范围：0~4294967295
 * @param	len		:	指定数字的长度，范围：0~10
 * @param	size	:	指定字体大小
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_num(oled_dev_t *dev, uint8_t x, uint8_t y, uint32_t num, uint8_t len, uint8_t size)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i;
	for (i = 0; i < len; i++)		// 遍历数字的每一位							
	{
		/* 调用__oled_show_char函数，依次显示每个数字 */
		/* Number / __oled_pow(10, len - i - 1) % 10 可以十进制提取数字的每一位 */
		/* + '0' 可将数字转换为字符格式 */
		__oled_show_char(dev, x + i * size, y, num / __oled_pow(10, len - i - 1) % 10 + '0', size);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示有符号数字（十进制，整数）
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定数字左上角的横坐标，范围：0~127
 * @param	y		:	指定数字左上角的纵坐标，范围：0~63
 * @param	num		:	指定要显示的数字，范围：-2147483648~2147483647
 * @param	len		:	指定数字的长度，范围：0~10
 * @param	size	:	指定字体大小
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_signed_num(oled_dev_t *dev, uint8_t x, uint8_t y, int32_t num, uint8_t len, uint8_t size)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i;
	uint32_t num1;
	
	if (num >= 0)								// 数字大于等于0
	{
		__oled_show_char(dev, x, y, '+', size);// 显示+号
		num1 = num;							// Number1直接等于Number
	}
	else											// 数字小于0
	{
		__oled_show_char(dev, x, y, '-', size);// 显示-号
		num1 = -num;							// Number1等于Number取负
	}
	
	for (i = 0; i < len; i++)					// 遍历数字的每一位								
	{
		/* 调用__oled_show_char函数，依次显示每个数字 */
		/* num1 / __oled_pow(10, len - i - 1) % 10 可以十进制提取数字的每一位 */
		/* + '0' 可将数字转换为字符格式 */
		__oled_show_char(dev, x + (i + 1) * size, y, num1 / __oled_pow(10, len - i - 1) % 10 + '0', size);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示十六进制数字（十六进制，正整数）
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定数字左上角的横坐标，范围：0~127
 * @param	y		:	指定数字左上角的纵坐标，范围：0~63
 * @param	num		:	指定要显示的数字，范围：0x00000000~0xFFFFFFFF
 * @param	len		:	指定数字的长度，范围：0~8
 * @param	size	:	指定字体大小
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_hex_num(oled_dev_t *dev, uint8_t x, uint8_t y, uint32_t num, uint8_t len, uint8_t size)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i, single_num;
	for (i = 0; i < len; i++)		// 遍历数字的每一位
	{
		/* 以十六进制提取数字的每一位 */
		single_num = num / __oled_pow(16, len - i - 1) % 16;
		
		if (single_num < 10)			// 单个数字小于10
		{
			/* 调用__oled_show_char函数，显示此数字 */
			/* + '0' 可将数字转换为字符格式 */
			__oled_show_char(dev, x + i * size, y, single_num + '0', size);
		}
		else							// 单个数字大于10
		{
			/* 调用__oled_show_char函数，显示此数字 */
			/* + 'A' 可将数字转换为从A开始的十六进制字符 */
			__oled_show_char(dev, x + i * size, y, single_num - 10 + 'A', size);
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示二进制数字（二进制，正整数）
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定数字左上角的横坐标，范围：0~127
 * @param	y		:	指定数字左上角的纵坐标，范围：0~63
 * @param	num		:	指定要显示的数字，范围：0x00000000~0xFFFFFFFF
 * @param	len		:	指定数字的长度，范围：0~16
 * @param	size	:	指定字体大小
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_bin_num(oled_dev_t *dev, uint8_t x, uint8_t y, uint32_t num, uint8_t len, uint8_t size)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i;
	for (i = 0; i < len; i++)		// 遍历数字的每一位	
	{
		/* 调用__oled_show_char函数，依次显示每个数字 */
		/* Number / __oled_pow(2, len - i - 1) % 2 可以二进制提取数字的每一位 */
		/* + '0' 可将数字转换为字符格式 */
		__oled_show_char(dev, x + i * size, y, num / __oled_pow(2, len - i - 1) % 2 + '0', size);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示二进制数字（二进制，正整数）
 * @param	dev			:	oled_dev_t 结构体指针
 * @param	x			:	指定数字左上角的横坐标，范围：0~127
 * @param	y			:	指定数字左上角的纵坐标，范围：0~63
 * @param	num			:	指定要显示的数字，范围：-4294967295.0~4294967295.0
 * @param	int_len		:	指定数字的整数位长度，范围：0~10
 * @param	fra_len		:	指定数字的小数位长度，范围：0~9，小数进行四舍五入显示
 * @param	size		:	指定字体大小
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_float_num(oled_dev_t *dev, uint8_t x, uint8_t y, double num, uint8_t int_len, uint8_t fra_len, uint8_t size)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint32_t pow_num, int_num, fra_num;
	
	if (num >= 0)						// 数字大于等于0
	{
		__oled_show_char(dev, x, y, '+', size);	// 显示+号
	}
	else									// 数字小于0
	{
		__oled_show_char(dev, x, y, '-', size);	// 显示-号
		num = -num;					// Number取负
	}
	
	/* 提取整数部分和小数部分 */
	int_num = num;						// 直接赋值给整型变量，提取整数
	num -= int_num;						// 将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
	pow_num = __oled_pow(10, fra_len);		// 根据指定小数的位数，确定乘数
	fra_num = round(num * pow_num);		// 将小数乘到整数，同时四舍五入，避免显示误差
	int_num += fra_num / pow_num;				// 若四舍五入造成了进位，则需要再加给整数
	
	/* 显示整数部分 */
	__oled_show_num(dev, x + size, y, int_num, int_len, size);
	
