903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
	/* 显示小数点 */
	__oled_show_char(dev, x + (int_len + 1) * size, y, '.', size);
	
	/* 显示小数部分 */
	__oled_show_num(dev, x + (int_len + 2) * size, y, fra_num, fra_len, size);
	
	return 0;
}

/******************************************************************************
 * @brief	OLED显示汉字串
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定汉字串左上角的横坐标，范围：0~127
 * @param	y		:	指定汉字串左上角的纵坐标，范围：0~63
 * @param	chinese	:	指定要显示的汉字串，范围：必须全部为汉字或者全角字符，不要加入任何半角字符
						显示的汉字需要在OLED_data.c里的oled_cf16x16数组定义
						未找到指定汉字时，会显示默认图形（一个方框，内部一个问号）
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_show_chinese(oled_dev_t *dev, uint8_t x, uint8_t y, char *chinese)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t p_chinese = 0;
	uint8_t p_index;
	uint8_t i;
	char Singlechinese[OLED_CHN_CHAR_WIDTH + 1] = {0};
	
	for (i = 0; chinese[i] != '\0'; i ++)		// 遍历汉字串
	{
		Singlechinese[p_chinese] = chinese[i];	// 提取汉字串数据到单个汉字数组
		p_chinese ++;							// 计次自增
		
		/* 当提取次数到达OLED_CHN_CHAR_WIDTH时，即代表提取到了一个完整的汉字 */
		if (p_chinese >= OLED_CHN_CHAR_WIDTH)
		{
			p_chinese = 0;		// 计次归零
			
			/* 遍历整个汉字字模库，寻找匹配的汉字 */
			/* 如果找到最后一个汉字（定义为空字符串），则表示汉字未在字模库定义，停止寻找 */
			for (p_index = 0; strcmp(oled_cf16x16[p_index].index, "") != 0; p_index ++)
			{
				/* 找到匹配的汉字 */
				if (strcmp(oled_cf16x16[p_index].index, Singlechinese) == 0)
				{
					break;		// 跳出循环，此时pindex的值为指定汉字的索引
				}
			}
			
			/* 将汉字字模库oled_cf16x16的指定数据以16*16的图像格式显示 */
			__oled_show_image(dev, x + ((i + 1) / OLED_CHN_CHAR_WIDTH - 1) * 16, y, 16, 16, oled_cf16x16[p_index].data);
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED使用printf函数打印格式化字符串
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x		:	指定格式化字符串左上角的横坐标，范围：0~127
 * @param	y		:	指定格式化字符串左上角的纵坐标，范围：0~63
 * @param	size	:	指定字体大小
 * @param	format	:	指定要显示的格式化字符串，范围：ASCII码可见字符组成的字符串
 * @param	...		:	格式化字符串参数列表
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_printf(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t size, char *format, ...)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	char string[30];						// 定义字符数组
	va_list arg;							// 定义可变参数列表数据类型的变量arg
	va_start(arg, format);					// 从format开始，接收参数列表到arg变量
	vsprintf(string, format, arg);			// 使用vsprintf打印格式化字符串和参数列表到字符数组中
	va_end(arg);							// 结束变量arg
	__oled_show_string(dev, x, y, string, size);// OLED显示字符数组（字符串）
	
	return 0;
}

/******************************************************************************
 * @brief	OLED在指定位置画一个点
 * @param	dev	:	oled_dev_t 结构体指针
 * @param	x	:	指定点的横坐标，范围：0~127
 * @param	y	:	指定点的纵坐标，范围：0~63
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_point(oled_dev_t *dev, uint8_t x, uint8_t y)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	if (!dev || !dev->init_flag)
		return -1;
	
	/* 参数检查，保证指定位置不会超出屏幕范围 */
	if (x > 127) {return -1;}
	if (y > 63) {return -1;}
	
	/* 将显存数组指定位置的一个Bit数据置1 */
	g_oled_display_buf[priv_data->index][y / 8][x] |= 0x01 << (y % 8);
	
	return 0;
}

/******************************************************************************
 * @brief	OLED获取指定位置点的值
 * @param	dev	:	oled_dev_t 结构体指针
 * @param	x	:	指定点的横坐标，范围：0~127
 * @param	y	:	指定点的纵坐标，范围：0~63
 * @return	指定位置点是否处于点亮状态，1：点亮，0：熄灭
 ******************************************************************************/
static uint8_t __oled_get_point(oled_dev_t *dev, uint8_t x, uint8_t y)
{
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	/* 参数检查，保证指定位置不会超出屏幕范围 */
	if (x > 127) {return 0;}
	if (y > 63) {return 0;}
	
	/* 判断指定位置的数据 */
	if (g_oled_display_buf[priv_data->index][y / 8][x] & 0x01 << (y % 8))
	{
		return 1;	// 为1，返回1
	}
	return 0;		// 否则，返回0
}

/******************************************************************************
 * @brief	OLED画线
 * @param	dev		:	oled_dev_t 结构体指针
 * @param	x0		:	指定一个端点的横坐标，范围：0~127
 * @param	y0		:	指定一个端点的纵坐标，范围：0~63
 * @param	x1		:	指定另一个端点的横坐标，范围：0~127
 * @param	y1		:	指定另一个端点的纵坐标，范围：0~63
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_line(oled_dev_t *dev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	int16_t x, y, dx, dy, d, incrE, incr_ne, temp;
	uint8_t yflag = 0, xyflag = 0;
	
	if (y0 == y1)		// 横线单独处理
	{
		/* 0号点X坐标大于1号点X坐标，则交换两点X坐标 */
		if (x0 > x1) {temp = x0; x0 = x1; x1 = temp;}
		
		/* 遍历X坐标 */
		for (x = x0; x <= x1; x ++)
		{
			__oled_draw_point(dev, x, y0);	// 依次画点
		}
	}
	else if (x0 == x1)	// 竖线单独处理
	{
		/* 0号点Y坐标大于1号点Y坐标，则交换两点Y坐标 */
		if (y0 > y1) {temp = y0; y0 = y1; y1 = temp;}
		
		/* 遍历Y坐标 */
		for (y = y0; y <= y1; y ++)
		{
			__oled_draw_point(dev, x0, y);	// 依次画点
		}
	}
	else				// 斜线
	{
		/* 使用Bresenham算法画直线，可以避免耗时的浮点运算，效率更高 */
		/* 参考文档：https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf */
		/* 参考教程：https://www.bilibili.com/video/BV1364y1d7Lo */
		
		if (x0 > x1)	// 0号点X坐标大于1号点X坐标
		{
			/* 交换两点坐标 */
			/* 交换后不影响画线，但是画线方向由第一、二、三、四象限变为第一、四象限 */
			temp = x0; x0 = x1; x1 = temp;
			temp = y0; y0 = y1; y1 = temp;
		}
		
		if (y0 > y1)	// 0号点Y坐标大于1号点Y坐标
		{
			/* 将Y坐标取负 */
			/* 取负后影响画线，但是画线方向由第一、四象限变为第一象限 */
			y0 = -y0;
			y1 = -y1;
			
			/* 置标志位yflag，记住当前变换，在后续实际画线时，再将坐标换回来 */
			yflag = 1;
		}
		
		if (y1 - y0 > x1 - x0)	// 画线斜率大于1
		{
			/* 将X坐标与Y坐标互换 */
			/* 互换后影响画线，但是画线方向由第一象限0~90度范围变为第一象限0~45度范围 */
			temp = x0; x0 = y0; y0 = temp;
			temp = x1; x1 = y1; y1 = temp;
			
			/* 置标志位xyflag，记住当前变换，在后续实际画线时，再将坐标换回来 */
			xyflag = 1;
		}
		
		/* 以下为Bresenham算法画直线 */
		/* 算法要求，画线方向必须为第一象限0~45度范围 */
		dx = x1 - x0;
		dy = y1 - y0;
		incrE = 2 * dy;
		incr_ne = 2 * (dy - dx);
		d = 2 * dy - dx;
		x = x0;
		y = y0;
		
		/* 画起始点，同时判断标志位，将坐标换回来 */
		if (yflag && xyflag){__oled_draw_point(dev, y, -x);}
		else if (yflag)		{__oled_draw_point(dev, x, -y);}
		else if (xyflag)	{__oled_draw_point(dev, y, x);}
		else				{__oled_draw_point(dev, x, y);}
		
		while (x < x1)		// 遍历X轴的每个点
		{
			x ++;
			if (d < 0)		// 下一个点在当前点东方
			{
				d += incrE;
			}
			else			// 下一个点在当前点东北方
			{
				y ++;
				d += incr_ne;
			}
			
