903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
			/* 画每一个点，同时判断标志位，将坐标换回来 */
			if (yflag && xyflag){__oled_draw_point(dev, y, -x);}
			else if (yflag)		{__oled_draw_point(dev, x, -y);}
			else if (xyflag)	{__oled_draw_point(dev, y, x);}
			else				{__oled_draw_point(dev, x, y);}
		}	
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED矩形
 * @param	dev			:	oled_dev_t 结构体指针
 * @param	x			:	指定矩形左上角的横坐标，范围：0~127
 * @param	y			:	指定矩形左上角的纵坐标，范围：0~63
 * @param	width		:	指定矩形的宽度，范围：0~128
 * @param	height		:	指定矩形的高度，范围：0~64
 * @param	is_filled	:	指定矩形是否填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_rectangle(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint8_t is_filled)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t i, j;
	if (!is_filled)		// 指定矩形不填充
	{
		/* 遍历上下x坐标，画矩形上下两条线 */
		for (i = x; i < x + width; i ++)
		{
			__oled_draw_point(dev, i, y);
			__oled_draw_point(dev, i, y + height - 1);
		}
		/* 遍历左右y坐标，画矩形左右两条线 */
		for (i = y; i < y + height; i ++)
		{
			__oled_draw_point(dev, x, i);
			__oled_draw_point(dev, x + width - 1, i);
		}
	}
	else				// 指定矩形填充
	{
		/* 遍历x坐标 */
		for (i = x; i < x + width; i ++)
		{
			/* 遍历y坐标 */
			for (j = y; j < y + height; j ++)
			{
				/* 在指定区域画点，填充满矩形 */
				__oled_draw_point(dev, i, j);
			}
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED三角形
 * @param	dev			:	oled_dev_t 结构体指针
 * @param	x0			:	指定第一个端点的横坐标，范围：0~127
 * @param	y0			:	指定第一个端点的纵坐标，范围：0~63
 * @param	x1			:	指定第二个端点的横坐标，范围：0~127
 * @param	y1			:	指定第二个端点的纵坐标，范围：0~63
 * @param	x2			:	指定第三个端点的横坐标，范围：0~127
 * @param	y2			:	指定第三个端点的纵坐标，范围：0~63
 * @param	is_filled	:	指定三角形是否填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_triangle(oled_dev_t *dev, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, uint8_t is_filled)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	uint8_t minx = x0, miny = y0, maxx = x0, maxy = y0;
	uint8_t i, j;
	int16_t vx[] = {x0, x1, x2};
	int16_t vy[] = {y0, y1, y2};
	
	if (!is_filled)			// 指定三角形不填充
	{
		/* 调用画线函数，将三个点用直线连接 */
		__oled_draw_line(dev, x0, y0, x1, y1);
		__oled_draw_line(dev, x0, y0, x2, y2);
		__oled_draw_line(dev, x1, y1, x2, y2);
	}
	else					// 指定三角形填充
	{
		/* 找到三个点最小的X、Y坐标 */
		if (x1 < minx) {minx = x1;}
		if (x2 < minx) {minx = x2;}
		if (y1 < miny) {miny = y1;}
		if (y2 < miny) {miny = y2;}
		
		/* 找到三个点最大的X、Y坐标 */
		if (x1 > maxx) {maxx = x1;}
		if (x2 > maxx) {maxx = x2;}
		if (y1 > maxy) {maxy = y1;}
		if (y2 > maxy) {maxy = y2;}
		
		/* 最小最大坐标之间的矩形为可能需要填充的区域 */
		/* 遍历此区域中所有的点 */
		/* 遍历X坐标 */		
		for (i = minx; i <= maxx; i ++)
		{
			/* 遍历Y坐标 */	
			for (j = miny; j <= maxy; j ++)
			{
				/* 调用__oled_pnpoly，判断指定点是否在指定三角形之中 */
				/* 如果在，则画点，如果不在，则不做处理 */
				if (__oled_pnpoly(3, vx, vy, i, j)) {__oled_draw_point(dev, i, j);}
			}
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED画圆
 * @param	dev			:	oled_dev_t 结构体指针
 * @param	x			:	指定圆的圆心横坐标，范围：0~127
 * @param	y			:	指定圆的圆心纵坐标，范围：0~63
 * @param	radius		:	指定圆的半径，范围：0~255
 * @param	is_filled	:	指定圆是否填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_circle(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t radius, uint8_t is_filled)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	int16_t x1, y1, d, j;
	
	/* 使用Bresenham算法画圆，可以避免耗时的浮点运算，效率更高 */
	/* 参考文档：https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf */
	/* 参考教程：https://www.bilibili.com/video/BV1VM4y1u7wJ */
	
	d = 1 - radius;
	x1 = 0;
	y1 = radius;
	
	/* 画每个八分之一圆弧的起始点 */
	__oled_draw_point(dev, x + x1, y + y1);
	__oled_draw_point(dev, x - x1, y - y1);
	__oled_draw_point(dev, x + y1, y + x1);
	__oled_draw_point(dev, x - y1, y - x1);
	
	if (is_filled)		// 指定圆填充
	{
		/* 遍历起始点Y坐标 */
		for (j = -y1; j < y1; j ++)
		{
			/* 在指定区域画点，填充部分圆 */
			__oled_draw_point(dev, x, y + j);
		}
	}
	
	while (x1 < y1)		// 遍历X轴的每个点
	{
		x1 ++;
		if (d < 0)		// 下一个点在当前点东方
		{
			d += 2 * x1 + 1;
		}
		else			// 下一个点在当前点东南方
		{
			y1 --;
			d += 2 * (x1 - y1) + 1;
		}
		
		/* 画每个八分之一圆弧的点 */
		__oled_draw_point(dev, x + x1, y + y1);
		__oled_draw_point(dev, x + y1, y + x1);
		__oled_draw_point(dev, x - x1, y - y1);
		__oled_draw_point(dev, x - y1, y - x1);
		__oled_draw_point(dev, x + x1, y - y1);
		__oled_draw_point(dev, x + y1, y - x1);
		__oled_draw_point(dev, x - x1, y + y1);
		__oled_draw_point(dev, x - y1, y + x1);
		
		if (is_filled)	// 指定圆填充
		{
			/* 遍历中间部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在指定区域画点，填充部分圆 */
				__oled_draw_point(dev, x + x1, y + j);
				__oled_draw_point(dev, x - x1, y + j);
			}
			
			/* 遍历两侧部分 */
			for (j = -x1; j < x1; j ++)
			{
				/* 在指定区域画点，填充部分圆 */
				__oled_draw_point(dev, x - y1, y + j);
				__oled_draw_point(dev, x + y1, y + j);
			}
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED画椭圆
 * @param	dev			:	oled_dev_t 结构体指针
 * @param	x			:	指定椭圆的圆心横坐标，范围：0~127
 * @param	y			:	指定椭圆的圆心纵坐标，范围：0~63
 * @param	a			:	指定椭圆的横向半轴长度，范围：0~255
 * @param	b			:	指定椭圆的纵向半轴长度，范围：0~255
 * @param	is_filled	:	指定椭圆是否填充
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_ellipse(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t a, uint8_t b, uint8_t is_filled)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	int16_t x1, y1, j;
	float d1, d2;
	
	/* 使用Bresenham算法画椭圆，可以避免部分耗时的浮点运算，效率更高 */
	/* 参考链接：https://blog.csdn.net/myf_666/article/details/128167392 */
	
	x1 = 0;
	y1 = b;
	d1 = b * b + a * a * (-b + 0.5);
	
	if (is_filled)	// 指定椭圆填充
	{
		/* 遍历起始点Y坐标 */
		for (j = -y1; j < y1; j ++)
		{
			/* 在指定区域画点，填充部分椭圆 */
			__oled_draw_point(dev, x, y + j);
			__oled_draw_point(dev, x, y + j);
		}
	}
	
	/* 画椭圆弧的起始点 */
	__oled_draw_point(dev, x + x1, y + y1);
	__oled_draw_point(dev, x - x1, y - y1);
	__oled_draw_point(dev, x - x1, y + y1);
	__oled_draw_point(dev, x + x1, y - y1);
	
	/* 画椭圆中间部分 */
	while (b * b * (x1 + 1) < a * a * (y1 - 0.5))
	{
		if (d1 <= 0)		// 下一个点在当前点东方
		{
			d1 += b * b * (2 * x1 + 3);
		}
		else				// 下一个点在当前点东南方
		{
			d1 += b * b * (2 * x1 + 3) + a * a * (-2 * y1 + 2);
			y1 --;
		}
		x1 ++;
		
		if (is_filled)	// 指定椭圆填充
		{
			/* 遍历中间部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在指定区域画点，填充部分椭圆 */
				__oled_draw_point(dev, x + x1, y + j);
				__oled_draw_point(dev, x - x1, y + j);
			}
		}
		
		/* 画椭圆中间部分圆弧 */
		__oled_draw_point(dev, x + x1, y + y1);
		__oled_draw_point(dev, x - x1, y - y1);
		__oled_draw_point(dev, x - x1, y + y1);
		__oled_draw_point(dev, x + x1, y - y1);
	}                               
	
