903257958/stm32_oop_driver/stm32f103c8_spi_hard_dma_ssd1306/driver/oled.c
	/* 画椭圆两侧部分*/
	d2 = b * b * (x1 + 0.5) * (x1 + 0.5) + a * a * (y1 - 1) * (y1 - 1) - a * a * b * b;
	
	while (y1 > 0)
	{
		if (d2 <= 0)		// 下一个点在当前点东方
		{
			d2 += b * b * (2 * x1 + 2) + a * a * (-2 * y1 + 3);
			x1 ++;
			
		}
		else				// 下一个点在当前点东南方
		{
			d2 += a * a * (-2 * y1 + 3);
		}
		y1 --;
		
		if (is_filled)	// 指定椭圆填充
		{
			/* 遍历两侧部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在指定区域画点，填充部分椭圆 */
				__oled_draw_point(dev, x + x1, y + j);
				__oled_draw_point(dev, x - x1, y + j);
			}
		}
		
		/* 画椭圆两侧部分圆弧 */
		__oled_draw_point(dev, x + x1, y + y1);
		__oled_draw_point(dev, x - x1, y - y1);
		__oled_draw_point(dev, x - x1, y + y1);
		__oled_draw_point(dev, x + x1, y - y1);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	OLED画圆弧
 * @param	dev			:	oled_dev_t 结构体指针
 * @param	x			:	指定圆弧的圆心横坐标，范围：0~127
 * @param	y			:	指定圆弧的圆心纵坐标，范围：0~63
 * @param	radius		:	指定圆弧的半径，范围：0~255
 * @param	start_angle	:	指定圆弧的起始角度，范围：-180~180
							水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param	end_angle	:	指定圆弧的终止角度，范围：-180~180
							水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param	is_filled	:	指定圆弧是否填充，填充后为扇形
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_draw_arc(oled_dev_t *dev, uint8_t x, uint8_t y, uint8_t radius, int16_t start_angle, int16_t end_angle, uint8_t is_filled)
{	
	if (!dev || !dev->init_flag)
		return -1;
	
	int16_t x1, y1, d, j;
	
	/* 此函数借用Bresenham算法画圆的方法 */
	
	d = 1 - radius;
	x1 = 0;
	y1 = radius;
	
	/* 在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
	if (__oled_is_in_angle(x1, y1, start_angle, end_angle))	{__oled_draw_point(dev, x + x1, y + y1);}
	if (__oled_is_in_angle(-x1, -y1, start_angle, end_angle)) {__oled_draw_point(dev, x - x1, y - y1);}
	if (__oled_is_in_angle(y1, x1, start_angle, end_angle)) {__oled_draw_point(dev, x + y1, y + x1);}
	if (__oled_is_in_angle(-y1, -x1, start_angle, end_angle)) {__oled_draw_point(dev, x - y1, y - x1);}
	
	if (is_filled)	// 指定圆弧填充
	{
		/* 遍历起始点Y坐标 */
		for (j = -y1; j < y1; j ++)
		{
			/* 在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
			if (__oled_is_in_angle(0, j, start_angle, end_angle)) {__oled_draw_point(dev, x, y + j);}
		}
	}
	
	while (x1 < y1)		// 遍历X轴的每个点
	{
		x1 ++;
		if (d < 0)		// 下一个点在当前点东方
		{
			d += 2 * x1 + 1;
		}
		else			// 下一个点在当前点东南方
		{
			y1 --;
			d += 2 * (x1 - y1) + 1;
		}
		
		/* 在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
		if (__oled_is_in_angle(x1, y1, start_angle, end_angle)) {__oled_draw_point(dev, x + x1, y + y1);}
		if (__oled_is_in_angle(y1, x1, start_angle, end_angle)) {__oled_draw_point(dev, x + y1, y + x1);}
		if (__oled_is_in_angle(-x1, -y1, start_angle, end_angle)) {__oled_draw_point(dev, x - x1, y - y1);}
		if (__oled_is_in_angle(-y1, -x1, start_angle, end_angle)) {__oled_draw_point(dev, x - y1, y - x1);}
		if (__oled_is_in_angle(x1, -y1, start_angle, end_angle)) {__oled_draw_point(dev, x + x1, y - y1);}
		if (__oled_is_in_angle(y1, -x1, start_angle, end_angle)) {__oled_draw_point(dev, x + y1, y - x1);}
		if (__oled_is_in_angle(-x1, y1, start_angle, end_angle)) {__oled_draw_point(dev, x - x1, y + y1);}
		if (__oled_is_in_angle(-y1, x1, start_angle, end_angle)) {__oled_draw_point(dev, x - y1, y + x1);}
		
		if (is_filled)	// 指定圆弧填充
		{
			/* 遍历中间部分 */
			for (j = -y1; j < y1; j ++)
			{
				/* 在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
				if (__oled_is_in_angle(x1, j, start_angle, end_angle)) {__oled_draw_point(dev, x + x1, y + j);}
				if (__oled_is_in_angle(-x1, j, start_angle, end_angle)) {__oled_draw_point(dev, x - x1, y + j);}
			}
			
			/*遍历两侧部分*/
			for (j = -x1; j < x1; j ++)
			{
				/* 在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理 */
				if (__oled_is_in_angle(-y1, j, start_angle, end_angle)) {__oled_draw_point(dev, x - y1, y + j);}
				if (__oled_is_in_angle(y1, j, start_angle, end_angle)) {__oled_draw_point(dev, x + y1, y + j);}
			}
		}
	}
	
	return 0;
}

/******************************************************************************
 * @brief	去初始化OLED
 * @param	dev	:	oled_dev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __oled_deinit(oled_dev_t *dev)
{  
	if (!dev || !dev->init_flag)
		return -1;
	
	oled_priv_data_t *priv_data = (oled_priv_data_t *)dev->priv_data;
	
	/* 去初始化硬件SPI */
	priv_data->spi.deinit(&priv_data->spi);
	
	/* 释放私有数据内存 */
	free(dev->priv_data);
	dev->priv_data = NULL;
	
	dev->init_flag = false;	// 修改初始化标志
	return 0;
}

/**********************************************************************功能函数*/
